nxp-mcuxpresso/mcux-soc-svd/MKE12Z9/MKE12Z9.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PWT</name>
      <description>Pulse Width Timer</description>
      <groupName>PWT</groupName>
      <prependToName>PWT_</prependToName>
      <baseAddress>0x40056000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWT_LPTMR0</name>
        <value>29</value>
      </interrupt>
      <registers>
        <register>
          <name>CS</name>
          <description>Pulse Width Timer Control and Status Register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PWTOV</name>
              <description>PWT Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWTOV_0</name>
                  <description>PWT counter no overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWTOV_1</name>
                  <description>PWT counter runs from 0xFFFF to 0x0000.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWTRDY</name>
              <description>PWT Pulse Width Valid</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWTRDY_0</name>
                  <description>PWT pulse width register(s) is not up-to-date.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWTRDY_1</name>
                  <description>PWT pulse width register(s) has been updated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCTLE</name>
              <description>First counter load enable after enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCTLE_0</name>
                  <description>Do not load the first counter values to corresponding registers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCTLE_1</name>
                  <description>Load the first coutner value to corresponding registers depended by the PWTIN level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWTSR</name>
              <description>PWT Soft Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWTSR_0</name>
                  <description>No action taken.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWTSR_1</name>
                  <description>Writing 1 to this field will perform soft reset to PWT.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POVIE</name>
              <description>PWT Counter Overflow Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POVIE_0</name>
                  <description>Disable PWT to generate interrupt when PWTOV is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POVIE_1</name>
                  <description>Enable PWT to generate interrupt when PWTOV is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRDYIE</name>
              <description>PWT Pulse Width Data Ready Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRDYIE_0</name>
                  <description>Disable PWT to generate interrupt when PWTRDY is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRDYIE_1</name>
                  <description>Enable PWT to generate interrupt when PWTRDY is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWTIE</name>
              <description>PWT Module Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWTIE_0</name>
                  <description>Disables the PWT to generate interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWTIE_1</name>
                  <description>Enables the PWT to generate interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWTEN</name>
              <description>PWT Module Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWTEN_0</name>
                  <description>The PWT is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWTEN_1</name>
                  <description>The PWT is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Pulse Width Timer Control Register</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRE</name>
              <description>PWT Clock Prescaler (CLKPRE) Setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRE_0</name>
                  <description>Clock divided by 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_1</name>
                  <description>Clock divided by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_2</name>
                  <description>Clock divided by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_3</name>
                  <description>Clock divided by 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_4</name>
                  <description>Clock divided by 16.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_5</name>
                  <description>Clock divided by 32.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_6</name>
                  <description>Clock divided by 64.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_7</name>
                  <description>Clock divided by 128.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL</name>
              <description>PWTIN Level when Overflows</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TGL</name>
              <description>PWTIN states Toggled from last state</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TGL_0</name>
                  <description>The selected PWTIN hasn't changed its original states from last time.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TGL_1</name>
                  <description>The selected PWTIN has toggled its states.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINSEL</name>
              <description>PWT Pulse Inputs Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PINSEL_0</name>
                  <description>PWTIN[0] is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINSEL_1</name>
                  <description>PWTIN[1] is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINSEL_2</name>
                  <description>PWTIN[2] enabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINSEL_3</name>
                  <description>PWTIN[3] enabled.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCLKS</name>
              <description>PWT Clock Source Selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLKS_0</name>
                  <description>PWT_CLK is selected as the clock source of PWT counter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCLKS_1</name>
                  <description>Alternative clock is selected as the clock source of PWT counter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PPH</name>
          <description>Pulse Width Timer Positive Pulse Width Register: High</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PPWH</name>
              <description>Positive Pulse Width[15:8]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPL</name>
          <description>Pulse Width Timer Positive Pulse Width Register: Low</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PPWL</name>
              <description>Positive Pulse Width[7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NPH</name>
          <description>Pulse Width Timer Negative Pulse Width Register: High</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NPWH</name>
              <description>Negative Pulse Width[15:8]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NPL</name>
          <description>Pulse Width Timer Negative Pulse Width Register: Low</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NPWL</name>
              <description>Negative Pulse Width[7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTH</name>
          <description>Pulse Width Timer Counter Register: High</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PWTH</name>
              <description>PWT counter[15:8]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTL</name>
          <description>Pulse Width Timer Counter Register: Low</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PWTL</name>
              <description>PWT counter[7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
